DataProcessors/бит_ЗаполнитьНачисленияПоУслугамЖКХПоПериоду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗаполнитьНачисленияПоУслугамЖКХПоПериоду</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПерерасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленияОбщедомовых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленияПоЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленияПоСчетчикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатКУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеАванса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВводНачальныхОстатковПоКУ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ВводНачальныхОстатковПоКУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХПоПериоду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХПоПериоду</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/бит_ВводНачальныхОстатковПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ВводНачальныхОстатковПоКУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийВводНачальныхОстатковПоКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНаЛС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/бит_ЗаполнитьНачисленияПоУслугамЖКХПоПериоду/Forms/Форма/Ext/Form/Module.bsl
// Требуется оптимизация.

#Область ПеременныеМодуля

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДоступность()
	
	Если Объект.СписокДокументов.Количество() > 0 Тогда
		Элементы.ОбновитьДвижения.Доступность = Истина;
	Иначе
		Элементы.ОбновитьДвижения.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Включаем флаги, могут быть перенастроены через сохраненные пользовательские настройки.
	Объект.НачисленияПоЛС		 = Истина;
	Объект.НачисленияПоСчетчикам = Истина;
	Объект.ОплатКУ				 = Истина;
	Объект.РаспределениеАванса	 = Истина;
	Объект.НачисленияОбщедомовых = Истина;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокДокументовПриИзменении(Элемент)
	
	ОбновитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВводНачальныхОстатковПоКУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение)
		ИЛИ Объект.СписокДокументов.НайтиСтроки(Новый Структура("ВводНачальныхОстатковПоКУ", ВыбранноеЗначение)).Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = НСтр("ru = 'Выбранный документ уже присутствует в списке.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДвижения(Команда)
	
	Если Объект.СписокДокументов.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьДвиженияЗавершение", ЭтотОбъект)
												, "Будет выполненно обновление всех движений. Продолжить?"
												, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;											
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДвиженияЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		
		ПараметрыЗаполнения = Новый Структура();
		ПараметрыЗаполнения.Вставить("ДатаНачала"			, Период.ДатаНачала);
		ПараметрыЗаполнения.Вставить("ДатаОкончания"		, Период.ДатаОкончания);
		ПараметрыЗаполнения.Вставить("ВводНачальныхОстатков", Объект.СписокДокументов);
		ПараметрыЗаполнения.Вставить("Организация"			, Объект.Организация);
		ПараметрыЗаполнения.Вставить("Ответственный"		, Ответственный);
		ПараметрыЗаполнения.Вставить("ДатаПерерасчета"		, Объект.ДатаПерерасчета);
		
		ПараметрыЗаполнения.Вставить("НачисленияПоЛС"		, Объект.НачисленияПоЛС);
		ПараметрыЗаполнения.Вставить("НачисленияПоСчетчикам", Объект.НачисленияПоСчетчикам);
		ПараметрыЗаполнения.Вставить("ОплатКУ"				, Объект.ОплатКУ);
		ПараметрыЗаполнения.Вставить("РаспределениеАванса"	, Объект.РаспределениеАванса);
		ПараметрыЗаполнения.Вставить("НачисленияОбщедомовых", Объект.НачисленияОбщедомовых);
		
		ОбновитьДвиженияНаСервере(ПараметрыЗаполнения);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьДвиженияНаСервере(ПараметрыЗаполнения)
	
	ТабВводНачальныхОстатков = ПараметрыЗаполнения.ВводНачальныхОстатков.Выгрузить();
	ТабВНО = ТабВводНачальныхОстатков.Скопировать(Новый Структура("Использовать", Истина));
	ТабВНО.Свернуть("ВводНачальныхОстатковПоКУ",);
	МассивВводНачальныхОстатков = ТабВНО.ВыгрузитьКолонку("ВводНачальныхОстатковПоКУ");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВводНачальныхОстатков", МассивВводНачальныхОстатков);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ВводНачальныхОстатковПоКУ.Ссылка,
	|	бит_ВводНачальныхОстатковПоКУ.Период КАК Период,
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.ЛицевойСчет
	|ИЗ
	|	Документ.бит_ВводНачальныхОстатковПоКУ.СписокЛС КАК бит_ВводНачальныхОстатковПоКУСписокЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ВводНачальныхОстатковПоКУ КАК бит_ВводНачальныхОстатковПоКУ
	|		ПО бит_ВводНачальныхОстатковПоКУСписокЛС.Ссылка = бит_ВводНачальныхОстатковПоКУ.Ссылка
	|ГДЕ
	|	бит_ВводНачальныхОстатковПоКУ.Ссылка В(&ВводНачальныхОстатков)
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ВводНачальныхОстатковПоКУ.Период
	|ИТОГИ ПО
	|	Период";

	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		ДокументыВНО   = Новый Массив;
		ПолныйСписокЛС = Новый Массив;
		ВыборкаДок	   = Выборка.Выбрать(); 
		
		Пока ВыборкаДок.Следующий() Цикл
			Если ДокументыВНО.Найти(ВыборкаДок.Ссылка) = Неопределено Тогда
				ДокументыВНО.Добавить(ВыборкаДок.Ссылка);
			КонецЕсли;
			Если ПолныйСписокЛС.Найти(ВыборкаДок.ЛицевойСчет) = Неопределено Тогда
				ПолныйСписокЛС.Добавить(ВыборкаДок.ЛицевойСчет);
			КонецЕсли;
		КонецЦикла;
		
		Если ДокументыВНО.Количество() > 0 Тогда
			ОбработатьПачку(ДокументыВНО, ПараметрыЗаполнения, ПолныйСписокЛС);	
		КонецЕсли;
		
	КонецЦикла; 
	
	ТекстСообщения = НСтр("ru = 'Движения обновлены.'");
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьПачку(МассивДокументов, ПараметрыЗаполнения, ПолныйСписокЛС)
	
	мДатаТекст = Формат(ТекущаяДата(), "ДФ='ММММ гггг'");
	
	// Очистка движений по ЛС, до документа ввода начальных остатков.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВводНачальныхОстатков", МассивДокументов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ВводНачальныхОстатковПоКУ.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ВсеЛС
	|ИЗ
	|	Документ.бит_ВводНачальныхОстатковПоКУ.СписокЛС КАК бит_ВводНачальныхОстатковПоКУСписокЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ВводНачальныхОстатковПоКУ КАК бит_ВводНачальныхОстатковПоКУ
	|		ПО бит_ВводНачальныхОстатковПоКУСписокЛС.Ссылка = бит_ВводНачальныхОстатковПоКУ.Ссылка
	|ГДЕ
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.Ссылка В(&ВводНачальныхОстатков)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.ЛицевойСчет,
	|	бит_ВводНачальныхОстатковПоКУ.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период КАК Период,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ВсеДвижения
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_ВсеЛС.ЛицевойСчет
	|				ИЗ
	|					ВТ_ВсеЛС КАК ВТ_ВсеЛС)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
	|ГДЕ
	|	НЕ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор В(&ВводНачальныхОстатков)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВТ_ВсеДвижения.Регистратор, НЕОПРЕДЕЛЕНО) КАК Регистратор,
	|	ВТ_ВсеЛС.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	ВТ_ВсеЛС КАК ВТ_ВсеЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеДвижения КАК ВТ_ВсеДвижения
	|		ПО ВТ_ВсеЛС.ЛицевойСчет = ВТ_ВсеДвижения.ЛицевойСчет
	|			И ВТ_ВсеЛС.Период >= ВТ_ВсеДвижения.Период
	|ИТОГИ ПО
	|	Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Обход Периода.
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Регистратор) Тогда
			Продолжить;	
		КонецЕсли;
		
		НаборЗаписей = РегистрыНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		
		МассивЛС		  = Новый Массив;
		МассивДляУдаления = Новый Массив;
		
		// Обход ЛС.
		ВыборкаЛС = Выборка.Выбрать();
		
		Пока ВыборкаЛС.Следующий() Цикл
			Если МассивЛС.Найти(ВыборкаЛС.ЛицевойСчет) = Неопределено Тогда
				МассивЛС.Добавить(ВыборкаЛС.ЛицевойСчет);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивЛС.Количество() > 0 Тогда
			// Аккумулирует записи для удаления.
			Для Каждого Запись Из НаборЗаписей Цикл
				Если НЕ МассивЛС.Найти(Запись.ЛицевойСчет) = Неопределено Тогда
					МассивДляУдаления.Добавить(Запись);
				КонецЕсли;
			КонецЦикла;
			
			// Корректировка набора.
			Для Каждого Элт Из МассивДляУдаления Цикл
				НаборЗаписей.Удалить(Элт);
			КонецЦикла;
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
	КонецЦикла; 
	
	
	// Актуализация движений документов по ЛС, от момета ввода начальных остатков из регистра
	// бит_НачисленияПоУслугамЖКХ и документы бит_РаспределениеАванса.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВводНачальныхОстатков", МассивДокументов);
	
	Запрос.УстановитьПараметр("НачисленияПоЛС"		 , ПараметрыЗаполнения.НачисленияПоЛС);
	Запрос.УстановитьПараметр("НачисленияПоСчетчикам", ПараметрыЗаполнения.НачисленияПоСчетчикам);
	Запрос.УстановитьПараметр("НачисленияОбщедомовых", ПараметрыЗаполнения.НачисленияОбщедомовых);
	Запрос.УстановитьПараметр("ОплатКУ"				 , ПараметрыЗаполнения.ОплатКУ);
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.ДатаПерерасчета) Тогда
		Запрос.УстановитьПараметр("ДатаПерерасчета", КонецДня(ПараметрыЗаполнения.ДатаПерерасчета));
	Иначе
		Запрос.УстановитьПараметр("ДатаПерерасчета", Дата(1,1,1));
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ВводНачальныхОстатковПоКУ.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ВсеЛС
	|ИЗ
	|	Документ.бит_ВводНачальныхОстатковПоКУ.СписокЛС КАК бит_ВводНачальныхОстатковПоКУСписокЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ВводНачальныхОстатковПоКУ КАК бит_ВводНачальныхОстатковПоКУ
	|		ПО бит_ВводНачальныхОстатковПоКУСписокЛС.Ссылка = бит_ВводНачальныхОстатковПоКУ.Ссылка
	|ГДЕ
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.Ссылка В(&ВводНачальныхОстатков)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_ВводНачальныхОстатковПоКУСписокЛС.ЛицевойСчет,
	|	бит_ВводНачальныхОстатковПоКУ.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.Период КАК Период,
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ВсеДвижения
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
	|			,
	|			&ДатаПерерасчета {(&ДатаПерерасчета)},
	|			Регистратор,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_ВсеЛС.ЛицевойСчет
	|				ИЗ
	|					ВТ_ВсеЛС КАК ВТ_ВсеЛС)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|ГДЕ
	|	НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|	И ВЫБОР
	|			КОГДА &НачисленияПоЛС
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НачисленияПоСчетчикам
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НачисленияОбщедомовых
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОплатКУ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор
	|ПОМЕСТИТЬ ВТ_ВсеРаспределенияАванса
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(
	|			,
	|			&ДатаПерерасчета {(&ДатаПерерасчета)},
	|			Регистратор,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_ВсеЛС.ЛицевойСчет
	|				ИЗ
	|					ВТ_ВсеЛС КАК ВТ_ВсеЛС)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РаспределениеАванса
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОНЕЦПЕРИОДА(ВТ_ВсеРаспределенияАванса.Период, МЕСЯЦ) КАК ПериодМесяц,
	|	ВТ_ВсеРаспределенияАванса.Период КАК Период,
	|	ВТ_ВсеРаспределенияАванса.Регистратор КАК Регистратор
	|ИЗ
	|	ВТ_ВсеЛС КАК ВТ_ВсеЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеРаспределенияАванса КАК ВТ_ВсеРаспределенияАванса
	|		ПО ВТ_ВсеЛС.ЛицевойСчет = ВТ_ВсеРаспределенияАванса.ЛицевойСчет
	|			И ВТ_ВсеЛС.Период <= ВТ_ВсеРаспределенияАванса.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОНЕЦПЕРИОДА(ВТ_ВсеДвижения.Период, МЕСЯЦ) КАК ПериодМесяц,
	|	ВТ_ВсеДвижения.Период КАК Период,
	|	ВТ_ВсеДвижения.Регистратор КАК Регистратор
	|ИЗ
	|	ВТ_ВсеЛС КАК ВТ_ВсеЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеДвижения КАК ВТ_ВсеДвижения
	|		ПО ВТ_ВсеЛС.ЛицевойСчет = ВТ_ВсеДвижения.ЛицевойСчет
	|			И ВТ_ВсеЛС.Период < ВТ_ВсеДвижения.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ ПО
	|	ПериодМесяц";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка_РаспределениеАванса = РезультатЗапроса[3].Выбрать();
	
	СоотвРаспределениеАванса = Новый Соответствие();
	
	Пока Выборка_РаспределениеАванса.Следующий() Цикл
		
		ДокументРаспределениеАванса = Выборка_РаспределениеАванса.Регистратор.ПолучитьОбъект();
		ДокументРаспределениеАванса.СуммаДокумента = 0;
		ДокументРаспределениеАванса.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		СоотвРаспределениеАванса.Вставить(Выборка_РаспределениеАванса.ПериодМесяц, Выборка_РаспределениеАванса.Регистратор);	
	КонецЦикла;
	
	Выборка = РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		// Обход документов.
		ВыборкаДок = Выборка.Выбрать();
		Пока ВыборкаДок.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаДок.Регистратор) Тогда
				Продолжить;	
			КонецЕсли;
			
			Если ТипЗнч(ВыборкаДок.Регистратор) = Тип("ДокументСсылка.бит_НачисленияПоСчетчикам") 
				ИЛИ ТипЗнч(ВыборкаДок.Регистратор) = Тип("ДокументСсылка.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными") Тогда
				
				СоздатьДвиженияПоСчетчикам(ВыборкаДок.Регистратор);
				
			Иначе
				
				 Об = ВыборкаДок.Регистратор.ПолучитьОбъект();
				 Попытка
					 Об.Записать(РежимЗаписиДокумента.Проведение);
				 Исключение 
				 КонецПопытки
				 
			КонецЕсли;	
			
		КонецЦикла;
		
		
		// Разнесение аванса в конце месяца.
		Если НЕ ПараметрыЗаполнения.РаспределениеАванса Тогда
			Продолжить;	
		КонецЕсли;
		РаспределениеАванса = СоотвРаспределениеАванса.Получить(Выборка.ПериодМесяц);
		
		Если ЗначениеЗаполнено(РаспределениеАванса) Тогда
			ДокументРаспределениеАванса = РаспределениеАванса.ПолучитьОбъект();
			
			СписокЛС = ДокументРаспределениеАванса.СписокУслугПоПериоду.ВыгрузитьКолонку("ЛицевойСчет");
			ДокументРаспределениеАванса.СписокУслугПоПериоду.Очистить();
			ДокументРаспределениеАванса.ЗаполнитьСписокУслугВводНачальных(СписокЛС);
			
		Иначе
			ДокументРаспределениеАванса				  = Документы.бит_РаспределениеАванса.СоздатьДокумент();
			ДокументРаспределениеАванса.Дата          = КонецМесяца(Выборка.ПериодМесяц) - 1;
			ДокументРаспределениеАванса.Организация	  = ПараметрыЗаполнения.Организация;
			ДокументРаспределениеАванса.Ответственный = ПараметрыЗаполнения.Ответственный;
			ДокументРаспределениеАванса.Комментарий   = "Документ создан автоматически при заполнении начислений по периоду " + мДатаТекст;
			
			ДокументРаспределениеАванса.ЗаполнитьСписокУслугВводНачальных(ПолныйСписокЛС);
		КонецЕсли;
		
		
		Попытка
			Если ДокументРаспределениеАванса.СписокУслугПоПериоду.Количество() > 0 Тогда
				ДокументРаспределениеАванса.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДвиженияПоСчетчикам(Документ)
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.НомерСтроки,
		|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.ЛицевойСчет,
		|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Услуга,
		|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Начислено,
		|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Начисления
		|ИЗ
		|	Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Начисления КАК бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления
		|ГДЕ
		|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальнымиНачисления.Ссылка = &ДокументСсылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Начисления.НомерСтроки КАК НомерСтроки,
		|	ВТ_Начисления.ЛицевойСчет,
		|	ВТ_Начисления.Услуга,
		|	ВТ_Начисления.Начислено,
		|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Дата,
		|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Организация
		|ИЗ
		|	ВТ_Начисления КАК ВТ_Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными КАК бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
		|		ПО ВТ_Начисления.Ссылка = бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		Запрос.УстановитьПараметр("ДокументСсылка" , Документ);

		Выборка = Запрос.Выполнить().Выбрать();
		
		НаборЗаписей = РегистрыНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Документ);
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Начислено = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Выборка.Начислено > 0 Тогда
				ДвижениеПоПериоду = НаборЗаписей.ДобавитьПриход();
				ДвижениеПоПериоду.Сумма       = Выборка.Начислено;
			Иначе
				ДвижениеПоПериоду = НаборЗаписей.ДобавитьРасход();
				ДвижениеПоПериоду.Сумма       = (Выборка.Начислено * -1);
			КонецЕсли;
			
			ДвижениеПоПериоду.Период			   = Выборка.Дата;
			ДвижениеПоПериоду.ПериодВзаиморасчетов = Выборка.Дата;
			ДвижениеПоПериоду.ЛицевойСчет		   = Выборка.ЛицевойСчет;
			ДвижениеПоПериоду.УслугаЖКХ			   = Выборка.Услуга;
			ДвижениеПоПериоду.Организация		   = Выборка.Организация;
			
		КонецЦикла; 
		
		НаборЗаписей.Записать(Истина);
		
	Иначе // ДокументСсылка.бит_НачисленияПоСчетчикам.
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Приоритет,
		|	бит_НачисленияПоСчетчикамНачисления.НомерСтроки КАК НомерСтроки,
		|	бит_НачисленияПоСчетчикамНачисления.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_НачисленияПоСчетчикамНачисления.Услуга КАК Услуга,
		|	бит_НачисленияПоСчетчикамНачисления.Начислено КАК Начислено,
		|	бит_НачисленияПоСчетчикамНачисления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НачисленияРаспределения
		|ИЗ
		|	Документ.бит_НачисленияПоСчетчикам.Начисления КАК бит_НачисленияПоСчетчикамНачисления
		|ГДЕ
		|	бит_НачисленияПоСчетчикамНачисления.Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	бит_бит_НачисленияПоСчетчикамНачисленияРаспределения.НомерСтроки,
		|	бит_бит_НачисленияПоСчетчикамНачисленияРаспределения.ЛицевойСчет,
		|	бит_бит_НачисленияПоСчетчикамНачисленияРаспределения.Услуга,
		|	бит_бит_НачисленияПоСчетчикамНачисленияРаспределения.Начислено,
		|	бит_бит_НачисленияПоСчетчикамНачисленияРаспределения.Ссылка
		|ИЗ
		|	Документ.бит_НачисленияПоСчетчикам.Распределения КАК бит_бит_НачисленияПоСчетчикамНачисленияРаспределения
		|ГДЕ
		|	бит_бит_НачисленияПоСчетчикамНачисленияРаспределения.Ссылка = &ДокументСсылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НачисленияРаспределения.ЛицевойСчет,
		|	ВТ_НачисленияРаспределения.Услуга,
		|	ВТ_НачисленияРаспределения.Начислено,
		|	бит_НачисленияПоСчетчикам.Дата,
		|	бит_НачисленияПоСчетчикам.Организация
		|ИЗ
		|	ВТ_НачисленияРаспределения КАК ВТ_НачисленияРаспределения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_НачисленияПоСчетчикам КАК бит_НачисленияПоСчетчикам
		|		ПО ВТ_НачисленияРаспределения.Ссылка = бит_НачисленияПоСчетчикам.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_НачисленияРаспределения.Приоритет,
		|	ВТ_НачисленияРаспределения.НомерСтроки";
		Запрос.УстановитьПараметр("ДокументСсылка" , Документ);

		Выборка = Запрос.Выполнить().Выбрать();

		НаборЗаписей = РегистрыНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Документ);
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Начислено = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДвижениеПоПериоду					   = НаборЗаписей.Добавить();
			ДвижениеПоПериоду.Период			   = Выборка.Дата;
			ДвижениеПоПериоду.ПериодВзаиморасчетов = Выборка.Дата;
			ДвижениеПоПериоду.ЛицевойСчет		   = Выборка.ЛицевойСчет;
			ДвижениеПоПериоду.УслугаЖКХ			   = Выборка.Услуга;
			ДвижениеПоПериоду.Организация		   = Выборка.Организация;
			ДвижениеПоПериоду.Сумма				   = Выборка.Начислено;
			
		КонецЦикла; 
		
		НаборЗаписей.Записать(Истина);
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискДокументов(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если Объект.СписокДокументов.Количество() > 0 Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ПоискДокументовЗавершение", ЭтотОбъект)
											, "Очистить список документов ввода начальных остатков?"
											, РежимДиалогаВопрос.ДаНет);
		Иначе										
			ПоискДокументовНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискДокументовЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.СписокДокументов.Очистить();
		ПоискДокументовНаСервере(Истина);
	КонецЕсли;
	
	ПоискДокументовНаСервере();

КонецПроцедуры	

&НаСервере
Процедура ПоискДокументовНаСервере(ТабДокПуст = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала"	 , Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация"	 , Объект.Организация);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор КАК ВводНачальныхОстатковПоКУ
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ";
	
	Если ТабДокПуст Тогда
		Результат = Запрос.Выполнить().Выгрузить();
		Объект.СписокДокументов.Загрузить(Результат);
		
	Иначе
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Объект.СписокДокументов.НайтиСтроки(Новый Структура("ВводНачальныхОстатковПоКУ", Выборка.ВводНачальныхОстатковПоКУ)).Количество() = 0 Тогда
				Нстр = Объект.СписокДокументов.Добавить();
				ЗаполнитьЗначенияСвойств(Нстр, Выборка);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьДоступность();
	
КонецПроцедуры

#КонецОбласти
